app/controllers/courses_controller.rb

  def index
    if params[:subject_id]
      @courses = Subject.find(params[:subject_id]).courses
    else
      @courses = Course.all
---
SELECT * FROM `courses` WHERE (`courses`.subject_id = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `courses`

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`name`, `prerequisites`, `level_id`, `created_at`, `min_size`, `overview`, `delivery_type_id`, `updated_at`, `early_bird_date`, `subject_id`, `cost_in_cents`, `early_bird_cost_in_cents`, `location_id`, `max_size`) VALUES('Intro To Ruby', 'Be Gay.', 1, '2010-05-23 08:22:35', 2, 'Great course to learn how to program in Ruby.', 1, '2010-05-23 08:22:35', '2010-05-23 08:20:00', 1, 100, 1000, 1, 15)