app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.find(:all, :order => "name")
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)