app/controllers/subjects_controller.rb

SELECT * FROM `subjects`
---
  def index
    @subjects = Subject.all

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
---
  def show
    @subject = Subject.find(params[:id])

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
---
  def edit
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`, `created_at`, `code`, `updated_at`) VALUES('Agile Software Development', '2010-05-23 07:57:33', 'AGL', '2010-05-23 07:57:33')
---
  def create
    @subject = Subject.new(params[:subject])

    respond_to do |format|
      if @subject.save